# running in mem_led_axi_prf/src/
read -formal mem_led_axi.v
read -formal faxil_slave.v
hierarchy -top mem_led_axi
prep -top mem_led_axi

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
